NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/EFM32GG11B/EFM32GG11B310F2048GL112.svd
        <register>
          <name>OPA1_MUX</name>
          <description>Operational Amplifier Mux Configuration Register</description>
          <addressOffset>0x0D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0016F2F1</resetValue>
          <resetMask>0x0717FFFF</resetMask>
          <fields>
            <field>
              <name>POSSEL</name>
              <description>OPAx Non-inverting Input Mux</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEGSEL</name>
              <description>OPAx Inverting Input Mux</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESINMUX</name>
              <description>OPAx Resistor Ladder Input Mux</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Set for Unity Gain</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPANEXT</name>
                  <description>Set for NEXTOUT(x-1) input</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGPAD</name>
                  <description>NEG pad connected</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POSPAD</name>
                  <description>POS pad connected</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPAD</name>
                  <description>Neg pad of OPA0 connected. Direct input to support common reference.</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CENTER</name>
                  <description>OPA0 and OPA1 Resmux connected to form fully differential instrumentation amplifier.</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSS</name>
                  <description>VSS connected</description>
                  <value>0x00000006</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GAIN3X</name>
              <description>OPAx Dedicated 3x Gain Resistor Ladder</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESSEL</name>
              <description>OPAx Resistor Ladder Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES0</name>
                  <description>Gain of 1/3</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES1</name>
                  <description>Gain of 1</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES2</name>
                  <description>Gain of 1 2/3</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES3</name>
                  <description>Gain of 2 1/5</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES4</name>
                  <description>Gain of 3</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES5</name>
                  <description>Gain of 4 1/3</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES6</name>
                  <description>Gain of 7</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES7</name>
                  <description>Gain of 15</description>
                  <value>0x00000007</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OPA1_OUT</name>
          <description>Operational Amplifier Output Configuration Register</description>
          <addressOffset>0x0D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00FF01FF</resetMask>
          <fields>
            <field>
              <name>MAINOUTEN</name>
              <description>OPAx Main Output Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALTOUTEN</name>
              <description>OPAx Alternative Output Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APORTOUTEN</name>
              <description>OPAx Aport Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHORT</name>
              <description>OPAx Main and Alternative Output Short</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALTOUTPADEN</name>
              <description>OPAx Output Enable Value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUT0</name>
                  <description>Alternate Output 0</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT1</name>
                  <description>Alternate Output 1</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT2</name>
                  <description>Alternate Output 2</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT3</name>
                  <description>Alternate Output 3</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT4</name>
                  <description>Alternate Output 4</description>
                  <value>0x00000010</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APORTOUTSEL</name>
              <description>OPAx APORT Output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OPA1_CAL</name>
          <description>Operational Amplifier Calibration Register</description>
          <addressOffset>0x0D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000080E7</resetValue>
          <resetMask>0x7DF6EDEF</resetMask>
          <fields>
            <field>
              <name>CM1</name>
              <description>Compensation Cap Cm1 Trim Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CM2</name>
              <description>Compensation Cap Cm2 Trim Value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CM3</name>
              <description>Compensation Cap Cm3 Trim Value</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GM</name>
              <description>Gm Trim Value</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GM3</name>
              <description>Gm3 Trim Value</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSETP</name>
              <description>OPAx Non-Inverting Input Offset Configuration Value</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSETN</name>
              <description>OPAx Inverting Input Offset Configuration Value</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OPA2_APORTREQ</name>
          <description>Operational Amplifier APORT Request Status Register</description>
          <addressOffset>0x0E0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FC</resetMask>
          <fields>
            <field>
              <name>APORT1XREQ</name>
              <description>1 If the Bus Connected to APORT2X is Requested</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT1YREQ</name>
              <description>1 If the Bus Connected to APORT1X is Requested</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT2XREQ</name>
              <description>1 If the Bus Connected to APORT2X is Requested</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT2YREQ</name>
              <description>1 If the Bus Connected to APORT2Y is Requested</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT3XREQ</name>
              <description>1 If the Bus Connected to APORT3X is Requested</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT3YREQ</name>
              <description>1 If the Bus Connected to APORT3Y is Requested</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT4XREQ</name>
              <description>1 If the Bus Connected to APORT4X is Requested</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT4YREQ</name>
              <description>1 If the Bus Connected to APORT4Y is Requested</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OPA2_APORTCONFLICT</name>
          <description>Operational Amplifier APORT Conflict Status Register</description>
          <addressOffset>0x0E4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FC</resetMask>
          <fields>
            <field>
              <name>APORT1XCONFLICT</name>
              <description>1 If the Bus Connected to APORT1X is in Conflict With Another Peripheral</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT1YCONFLICT</name>
              <description>1 If the Bus Connected to APORT1X is in Conflict With Another Peripheral</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT2XCONFLICT</name>
              <description>1 If the Bus Connected to APORT2X is in Conflict With Another Peripheral</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT2YCONFLICT</name>
              <description>1 If the Bus Connected to APORT2Y is in Conflict With Another Peripheral</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT3XCONFLICT</name>
              <description>1 If the Bus Connected to APORT3X is in Conflict With Another Peripheral</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT3YCONFLICT</name>
              <description>1 If the Bus Connected to APORT3Y is in Conflict With Another Peripheral</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT4XCONFLICT</name>
              <description>1 If the Bus Connected to APORT4X is in Conflict With Another Peripheral</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORT4YCONFLICT</name>
              <description>1 If the Bus Connected to APORT4Y is in Conflict With Another Peripheral</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
